; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared2 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	thermograph0 - mode
	image1 - mode
	infrared5 - mode
	image6 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared5)
	(supports instrument1 image6)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument4 spectrograph4)
	(supports instrument4 infrared5)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 spectrograph3)
	(supports instrument6 image1)
	(supports instrument6 image6)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
)
(:goal (and
	(pointing satellite2 GroundStation2)
	(have_image Phenomenon7 spectrograph3)
	(have_image Phenomenon7 thermograph0)
	(have_image Planet8 image1)
	(have_image Planet8 thermograph0)
	(have_image Star9 spectrograph4)
	(have_image Star9 image1)
	(have_image Star10 thermograph0)
	(have_image Star10 infrared5)
	(have_image Planet11 infrared2)
	(have_image Planet11 image1)
	(have_image Phenomenon12 image6)
	(have_image Star13 image6)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 13
2. (calibrate satellite2 instrument6 groundstation5)
   added: (calibrated instrument6)
   goals met: 0 of 13
3. (turn_to satellite2 star13 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 star13)
   goals met: 0 of 13
4. (take_image satellite2 star13 instrument6 image6)
   added: (have_image star13 image6)
   goals met: 1 of 13
5. (turn_to satellite2 phenomenon7 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 13
6. (take_image satellite2 phenomenon7 instrument6 spectrograph3)
   added: (have_image phenomenon7 spectrograph3)
   goals met: 2 of 13
7. (turn_to satellite2 phenomenon12 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 13
8. (take_image satellite2 phenomenon12 instrument6 image6)
   added: (have_image phenomenon12 image6)
   goals met: 3 of 13
9. (turn_to satellite2 groundstation2 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 groundstation2)
   goals met: 4 of 13
10. (turn_to satellite1 groundstation2 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation2)
   goals met: 4 of 13
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 13
12. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 4 of 13
13. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 4 of 13
14. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 4 of 13
15. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 4 of 13
16. (turn_to satellite1 phenomenon7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 13
17. (take_image satellite1 phenomenon7 instrument3 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 5 of 13
18. (turn_to satellite1 planet11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet11)
   goals met: 5 of 13
19. (take_image satellite1 planet11 instrument3 image1)
   added: (have_image planet11 image1)
   goals met: 6 of 13
20. (take_image satellite1 planet11 instrument3 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 7 of 13
21. (turn_to satellite1 planet8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet8)
   goals met: 7 of 13
22. (take_image satellite1 planet8 instrument3 image1)
   added: (have_image planet8 image1)
   goals met: 8 of 13
23. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 9 of 13
24. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 9 of 13
25. (take_image satellite1 star10 instrument3 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 10 of 13
26. (turn_to satellite2 star10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star10)
   goals met: 9 of 13
27. (take_image satellite2 star10 instrument4 infrared5)
   added: (have_image star10 infrared5)
   goals met: 10 of 13
28. (turn_to satellite2 star9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star9)
   goals met: 10 of 13
29. (take_image satellite2 star9 instrument4 image1)
   added: (have_image star9 image1)
   goals met: 11 of 13
30. (take_image satellite2 star9 instrument4 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 12 of 13
31. (turn_to satellite2 groundstation2 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation2)
   goals met: 13 of 13
